quarkus/.results/latency-graalvm.txt
Running 3m test @ http://localhost:8100/conferences
  5 threads and 100 connections
  Thread calibration: mean lat.: 6.340ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.365ms, rate sampling interval: 18ms
  Thread calibration: mean lat.: 6.310ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 6.323ms, rate sampling interval: 17ms
  Thread calibration: mean lat.: 11.415ms, rate sampling interval: 36ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.27ms   11.42ms 355.58ms   96.69%
    Req/Sec   205.63    100.49     1.19k    83.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.83ms
 75.000%    8.53ms
 90.000%   13.79ms
 99.000%   27.14ms
 99.900%  202.62ms
 99.990%  274.43ms
 99.999%  306.94ms
100.000%  355.84ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.419     0.000000            1         1.00
       4.483     0.100000        17119         1.11
       4.835     0.200000        34092         1.25
       5.139     0.300000        51132         1.43
       5.447     0.400000        67967         1.67
       5.831     0.500000        84957         2.00
       6.095     0.550000        93481         2.22
       6.467     0.600000       101967         2.50
       7.035     0.650000       110446         2.86
       7.743     0.700000       118955         3.33
       8.527     0.750000       127470         4.00
       8.991     0.775000       131731         4.44
       9.543     0.800000       135925         5.00
      10.279     0.825000       140194         5.71
      11.247     0.850000       144425         6.67
      12.375     0.875000       148687         8.00
      13.055     0.887500       150794         8.89
      13.791     0.900000       152930        10.00
      14.671     0.912500       155050        11.43
      15.687     0.925000       157169        13.33
      16.783     0.937500       159299        16.00
      17.327     0.943750       160359        17.78
      17.871     0.950000       161406        20.00
      18.463     0.956250       162478        22.86
      19.151     0.962500       163547        26.67
      19.983     0.968750       164604        32.00
      20.463     0.971875       165125        35.56
      21.103     0.975000       165657        40.00
      21.839     0.978125       166189        45.71
      22.719     0.981250       166722        53.33
      23.855     0.984375       167256        64.00
      24.575     0.985938       167519        71.11
      25.391     0.987500       167785        80.00
      26.447     0.989062       168045        91.43
      27.695     0.990625       168311       106.67
      29.647     0.992188       168575       128.00
      30.943     0.992969       168707       142.22
      32.991     0.993750       168840       160.00
      37.631     0.994531       168972       182.86
      47.327     0.995313       169105       213.33
      80.383     0.996094       169238       256.00
      96.191     0.996484       169304       284.44
     109.311     0.996875       169371       320.00
     128.767     0.997266       169437       365.71
     147.583     0.997656       169505       426.67
     164.095     0.998047       169570       512.00
     176.127     0.998242       169603       568.89
     182.271     0.998437       169636       640.00
     188.031     0.998633       169669       731.43
     195.199     0.998828       169702       853.33
     203.007     0.999023       169736      1024.00
     207.487     0.999121       169753      1137.78
     208.639     0.999219       169769      1280.00
     215.295     0.999316       169785      1462.86
     223.487     0.999414       169802      1706.67
     230.271     0.999512       169819      2048.00
     236.031     0.999561       169827      2275.56
     240.895     0.999609       169835      2560.00
     243.199     0.999658       169843      2925.71
     248.191     0.999707       169852      3413.33
     259.839     0.999756       169861      4096.00
     261.759     0.999780       169864      4551.11
     264.447     0.999805       169868      5120.00
     266.239     0.999829       169872      5851.43
     271.615     0.999854       169877      6826.67
     273.663     0.999878       169881      8192.00
     274.175     0.999890       169883      9102.22
     274.687     0.999902       169885     10240.00
     277.503     0.999915       169887     11702.86
     278.527     0.999927       169890     13653.33
     279.551     0.999939       169892     16384.00
     279.551     0.999945       169892     18204.44
     279.807     0.999951       169894     20480.00
     279.807     0.999957       169894     23405.71
     280.575     0.999963       169895     27306.67
     280.831     0.999969       169896     32768.00
     282.623     0.999973       169897     36408.89
     282.623     0.999976       169897     40960.00
     286.975     0.999979       169898     46811.43
     286.975     0.999982       169898     54613.33
     306.943     0.999985       169899     65536.00
     306.943     0.999986       169899     72817.78
     306.943     0.999988       169899     81920.00
     317.951     0.999989       169900     93622.86
     317.951     0.999991       169900    109226.67
     317.951     0.999992       169900    131072.00
     317.951     0.999993       169900    145635.56
     317.951     0.999994       169900    163840.00
     355.839     0.999995       169901    187245.71
     355.839     1.000000       169901          inf
#[Mean    =        8.269, StdDeviation   =       11.422]
#[Max     =      355.584, Total count    =       169901]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  179804 requests in 3.00m, 55.04MB read
Requests/sec:    998.84
Transfer/sec:    313.11KB