quarkus/.results/latency-jvm.txt
Running 3m test @ http://localhost:8100/conferences
  5 threads and 100 connections
  Thread calibration: mean lat.: 6.990ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 6.982ms, rate sampling interval: 22ms
  Thread calibration: mean lat.: 6.717ms, rate sampling interval: 20ms
  Thread calibration: mean lat.: 6.938ms, rate sampling interval: 21ms
  Thread calibration: mean lat.: 13.030ms, rate sampling interval: 39ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.79ms    4.49ms  42.66ms   84.77%
    Req/Sec   204.49     93.01   526.00     80.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.91ms
 75.000%    8.67ms
 90.000%   14.54ms
 99.000%   23.71ms
 99.900%   32.35ms
 99.990%   38.98ms
 99.999%   41.57ms
100.000%   42.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.169     0.000000            1         1.00
       4.463     0.100000        17039         1.11
       4.847     0.200000        34210         1.25
       5.159     0.300000        51121         1.43
       5.483     0.400000        68086         1.67
       5.907     0.500000        84992         2.00
       6.211     0.550000        93515         2.22
       6.623     0.600000       102011         2.50
       7.167     0.650000       110479         2.86
       7.827     0.700000       118975         3.33
       8.671     0.750000       127426         4.00
       9.279     0.775000       131684         4.44
      10.095     0.800000       135950         5.00
      11.151     0.825000       140173         5.71
      12.255     0.850000       144444         6.67
      13.335     0.875000       148678         8.00
      13.887     0.887500       150793         8.89
      14.535     0.900000       152914        10.00
      15.247     0.912500       155055        11.43
      16.023     0.925000       157164        13.33
      16.863     0.937500       159293        16.00
      17.311     0.943750       160384        17.78
      17.759     0.950000       161407        20.00
      18.255     0.956250       162485        22.86
      18.863     0.962500       163545        26.67
      19.535     0.968750       164591        32.00
      19.935     0.971875       165122        35.56
      20.383     0.975000       165657        40.00
      20.927     0.978125       166186        45.71
      21.503     0.981250       166732        53.33
      22.143     0.984375       167246        64.00
      22.527     0.985938       167521        71.11
      22.927     0.987500       167779        80.00
      23.407     0.989062       168047        91.43
      23.903     0.990625       168308       106.67
      24.415     0.992188       168577       128.00
      24.703     0.992969       168707       142.22
      25.039     0.993750       168842       160.00
      25.567     0.994531       168973       182.86
      26.031     0.995313       169105       213.33
      26.671     0.996094       169241       256.00
      26.991     0.996484       169307       284.44
      27.423     0.996875       169370       320.00
      27.967     0.997266       169436       365.71
      28.623     0.997656       169505       426.67
      29.391     0.998047       169571       512.00
      30.015     0.998242       169603       568.89
      30.639     0.998437       169637       640.00
      31.151     0.998633       169668       731.43
      31.711     0.998828       169701       853.33
      32.383     0.999023       169735      1024.00
      32.703     0.999121       169752      1137.78
      32.991     0.999219       169768      1280.00
      33.567     0.999316       169784      1462.86
      34.079     0.999414       169801      1706.67
      34.719     0.999512       169818      2048.00
      34.879     0.999561       169827      2275.56
      35.103     0.999609       169836      2560.00
      35.391     0.999658       169842      2925.71
      35.711     0.999707       169851      3413.33
      36.831     0.999756       169860      4096.00
      37.023     0.999780       169863      4551.11
      37.247     0.999805       169867      5120.00
      37.599     0.999829       169871      5851.43
      37.855     0.999854       169876      6826.67
      38.943     0.999878       169881      8192.00
      38.975     0.999890       169883      9102.22
      39.327     0.999902       169885     10240.00
      39.391     0.999915       169886     11702.86
      39.679     0.999927       169888     13653.33
      39.839     0.999939       169890     16384.00
      40.255     0.999945       169891     18204.44
      40.447     0.999951       169892     20480.00
      40.863     0.999957       169893     23405.71
      40.959     0.999963       169894     27306.67
      40.991     0.999969       169895     32768.00
      41.183     0.999973       169896     36408.89
      41.183     0.999976       169896     40960.00
      41.407     0.999979       169897     46811.43
      41.407     0.999982       169897     54613.33
      41.567     0.999985       169898     65536.00
      41.567     0.999986       169898     72817.78
      41.567     0.999988       169898     81920.00
      42.015     0.999989       169899     93622.86
      42.015     0.999991       169899    109226.67
      42.015     0.999992       169899    131072.00
      42.015     0.999993       169899    145635.56
      42.015     0.999994       169899    163840.00
      42.687     0.999995       169900    187245.71
      42.687     1.000000       169900          inf
#[Mean    =        7.791, StdDeviation   =        4.490]
#[Max     =       42.656, Total count    =       169900]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  179799 requests in 3.00m, 55.04MB read
Requests/sec:    998.84
Transfer/sec:    313.11KB